/**
 * Creation         :       2019.04.06 11:30
 * Last Reversion   :       2019.04.06 15:39:
 * Author           :       Lingyong Smile {smilelingyong@163.com}
 * File Type        :       cpp
 * -----------------------------------------------------------------
 * 题目描述：
 *    在如下一堆数字中选出一些数字求和，能够等于数字n。如果存在这样的方案则
 * 返回true，否则返回false。
 * int arr[] = {3, 34, 4, 12, 5, 2};
 * 测试用例：
 输入：
9
10
11
12
13
 输出：
1
1
1
1
0
 * -----------------------------------------------------------------
 * Crop right @ 2019 Lingyong Smile {smilelingyong@163.com}
 */